var policemen = [("『雖然你平常有在做小犯案，我都睜一隻眼閉一隻眼了』"),
                 ("（阿．．這個警察，這樣不行的吧）"),
                 ("一剎，警察面色凝重。"),
                 ("『你還記得你為什麼會昏倒在離慶典一段距離的小路上嗎？』")]

var friend = [("他們有點慌張並緊張的說："),
              ("『跟我們分開後發生了什麼事？"),
              ("我們發現你走失後一直再找你，"),
              ("但卻發現在有點距離的小路上發現你』")]

var stranger = [("『你還好嗎？』"),
                ("『恩，還好，請問你是．．．．．』"),
                ("『我剛路經你昏倒的小路上，把你帶來醫院。』"),
                ("『我？昏倒嗎？』"),
                ("『恩，不過慶典裡面很熱吧！大概你是想要出來透氣？．．．"),
                ("雖然是走得有點遠就是了。』")]

var storyArray = [("在熱鬧的慶典上開心地走著，平日以竊盜維生，難得不工作與朋友悠哉閒晃，"),
                   ("..."),
                   (".........."),
                   ("不小心與朋友走散了，"),
                   ("越走離慶典越遠，最後終於迷路了（應該是一開始就迷路了＝＝”）"),
                   ("快速的颼颼一聲"),
                   ("突然一陣昏眩... 應聲倒地"),
//7
                   (""),
                   ("天色還是暗的，輕撫後腦〔痛...〕，後腦有一塊凸起腫包，上面已有消毒與包紮。"),
                   ("環顧四週，被送到了醫院阿...),"),
                   ("但，是誰送我來的呢？"),
                   ("正當你在疑惑的時候，有人注意到你醒來，"),
                   ("（與此同時，護士通報了醫生你醒來的消息）"),
                   ("---"),
                   ("---"),
//                   ("『醒了嗎？！』"),
//                   ("說話的人是..."),
//15
                   (""),
                   ("聽完，有點不知道怎麼面對這樣的氣氛，"),
                   ("逐一地將與友人走失的過程，好好的解釋一番．．．"),
                   ("（但，為什麼我是昏倒在離慶典一小段距離的小路上呢？）"),
                   ("才剛要開始思考．．．"),
                   ("『喀喀』病房門打開，是醫生過來看你的狀況"),
                   ("『剛剛已經替你做過全身檢查，沒什麼大礙，等等拿完藥就可以回去了』"),
                   ("大概是見多了各種病人狀況，語氣沒多大的起伏，"),
                   ("隨後也只是淡淡的囑咐了一句．．．"),
//24
                   (""),
                   ("剛醒來狀況不是很好，送自己來醫院的人好心的替你拿了藥，"),
                   ("簡單的謝過人家後。時間也不晚了，趕忙回到家梳洗一番，"),
                   ("仰躺在床上，思考著今晚發生的事。"),
                   ("我覺得襲擊我的人是："),
                   ("")]
//28
//var sender = 1
//var i = 0
//var count = 0
//
//
//for i in 0...3{
//    // let count = i - 1
//    print(policemen[count])
//    count = count + 1
//}
var selectName = ""
var count = 0
var index = 0

//count += 1
//print(storyArray[count])


    switch selectName {
            case "":
               print(storyArray[count + 1])
            case policemen || friend || stranger :
               switch sender {
               case 10:
                   print("aaaa")
               case 11:
                   print("bbb")
               default:
                   break
               }
           default:
               break
           }

